---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorTotalWeight
source: html/a158234b-bfa7-2d5e-bfd5-4168829b037b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorTotalWeight Property

"Total Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemAnchorTotalWeight { get; }
```